"""0. Напишите программу, которая создает список из чисел от 1 до 20 и выводит его."""
sp = list(range(21))
print(sp)