"""Напишите программу, которая находит сумму и произведение всех элементов в списке"""
n = list()
su = 0
pr = 0
for s in n:
    su += s
    pr *= s
print(su, pr)