"""Напишите программу, которая создает новый список, состоящий только из четных чисел исходного списка"""
n = list()
for s in n:
    if s % 2 == 0:
        n.append(s)
print(n)