s = float(input())
f = 9 / 5 * s + 32
print(f)
"""Напишите программу, которая преобразует температуру в градусах Цельсия в градусы Фаренгейта по формуле:
F= 9/5 x C + 32
где C — температура в градусах Цельсия."""