""" 19. Напишите программу, которая выводит числа от 10 до 1 в обратном порядке, используя цикл while."""
s = 10
while True:
    if s == 0:
        break
    print(s)
    s -= 1