"""Напишите программу, которая запрашивает числа и выводит их, пока не введется число 0 (цикл должен завершиться с помощью break)."""
s = int(input())
while s != 0:
    print(s)
    s = int(input())