age = int(input())
if age < 18:
    print("Молодой")
elif 18 <= age < 60:
    print("Взрослый")
elif age >= 60:
    print("Пожилой")
"""•  Оценка возраста
Напишите программу, которая запрашивает возраст пользователя и выводит следующее сообщение:
 • • "Молодой", если возраст до 18 лет.
 • • "Взрослый", если возраст от 18 до 60 лет.
 • • "Пожилой", если возраст 60 лет и больше."""