s = int(input())
if s % 3 == 0 and s % 5 == 0:
    print("Прошел проверку")
else:
    print("Не прошел проверку")
"""Проверка на делимость
Напишите программу, которая проверяет, делится ли введенное число на 3 и на 5 одновременно, и выводит соответствующее сообщение."""