s = int(input())
if s % 7 == 0 and s % 5 != 0:
    print("Прошел проверку")
else:
    print("Не прошел проверку")
"""Напишите программу, которая проверяет, делится ли число на 7, но не на 5. num % 5 != 0 """