s = 1
b = int(input())
while s != b + 1:
    if s % 3 != 0:
        print(s)
    s += 1
"""11. Напишите программу, которая запрашивает число и выводит все числа от 1 до введенного числа, но пропускает числа, кратные 3"""