"""16. Напишите программу, которая запрашивает число и выводит сумму всех чисел до введенного (включая его) с использованием цикла while."""
s = 0
b = int(input())
while True:
    print(s)
    if s == b:
        break
    s += 1