"""Задание 1: Сумма двух чисел. Напишите функцию sum_two_numbers(a, b), которая
принимает два числа в качестве аргументов и возвращает их сумму. Затем протестируйте
функцию, передав ей различные значения."""
def sum_two_numbers(a, b):
    return a + b
print(sum_two_numbers(1, 2))