'''1. Дана строка python.• Выведите первый и последний символ. • Сделайте срез, чтобы получить pyt. • Сделайте срез, чтобы получить tho.'''
str = 'python'
print(str[0], str[-1])
print(str[:3])
print(str[2:-1])
print(str[::-1])