"""2. Преобразования регистра
 2. Дана строка "hello, python".
 • Преобразуйте её в верхний регистр.
 • Преобразуйте её в нижний регистр.
 • Сделайте так, чтобы каждое слово начиналось с большой буквы."""
str = 'hello, python'
print(str.upper())
print(str.lower())
print(str.capitalize())