"""3. Удаление пробелов
 3. Дана строка " Python is cool! ".
 • Удалите пробелы в начале и конце."""
str = "Python is cool!"
print(str.strip())