"""5. Разделение и объединение строк
 5. Дана строка "apple,banana,cherry".
 • Разбейте её в список по запятой.
 • Объедините элементы списка в строку через пробел."""
str = "apple,banana,cherry"
print(str.split(","))